Tekla Open API Reference for Tekla Structures 2025
Events.DrawingDeleted Event
 The DrawingDeleted event is raised when a drawing has been deleted.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.DrawingDeletedDelegate DrawingDeleted
Public Event DrawingDeleted As Events.DrawingDeletedDelegate
Value
Type: Tekla.Structures.Drawing.Events.DrawingDeletedDelegate
Implements
IEvents.DrawingDeleted
See Also
Reference
Events Class
Tekla.Structures.Drawing Namespace